
# 134. 加油站
topic="""
在一条环路上有 n 个加油站，其中第 i 个加油站有汽油 gas[i] 升。

你有一辆油箱容量无限的的汽车，从第 i 个加油站开往第 i+1 个加油站需要消耗汽油 cost[i] 升。你从其中的一个加油站出发，开始时油箱为空。

给定两个整数数组 gas 和 cost ，如果你可以按顺序绕环路行驶一周，则返回出发时加油站的编号，否则返回 -1 。如果存在解，则 保证 它是 唯一 的。

 

示例 1:

输入: gas = [1,2,3,4,5], cost = [3,4,5,1,2]
输出: 3
解释:
从 3 号加油站(索引为 3 处)出发，可获得 4 升汽油。此时油箱有 = 0 + 4 = 4 升汽油
开往 4 号加油站，此时油箱有 4 - 1 + 5 = 8 升汽油
开往 0 号加油站，此时油箱有 8 - 2 + 1 = 7 升汽油
开往 1 号加油站，此时油箱有 7 - 3 + 2 = 6 升汽油
开往 2 号加油站，此时油箱有 6 - 4 + 3 = 5 升汽油
开往 3 号加油站，你需要消耗 5 升汽油，正好足够你返回到 3 号加油站。
因此，3 可为起始索引。
示例 2:

输入: gas = [2,3,4], cost = [3,4,3]
输出: -1
解释:
你不能从 0 号或 1 号加油站出发，因为没有足够的汽油可以让你行驶到下一个加油站。
我们从 2 号加油站出发，可以获得 4 升汽油。 此时油箱有 = 0 + 4 = 4 升汽油
开往 0 号加油站，此时油箱有 4 - 3 + 2 = 3 升汽油
开往 1 号加油站，此时油箱有 3 - 3 + 3 = 3 升汽油
你无法返回 2 号加油站，因为返程需要消耗 4 升汽油，但是你的油箱只有 3 升汽油。
因此，无论怎样，你都不可能绕环路行驶一周。
"""


class Solution:
    def canCompleteCircuit(self, gas: List[int], cost: List[int]) -> int:
        # 可以按顺序绕环路行驶一周，意味着剩余油量大于消耗
        dgas = []
        dcost = []
        for i in range(2):
            for v in gas:
                dgas.append(v)
            for k in cost:
                dcost.append(k)
        dn = 2 * len(gas)
        n = len(gas)
        ans = -1
        gasnum = 0
        length = 0
        for i in range(dn):
            gasnum += dgas[i]
            gasnum -= dcost[i]
            if gasnum < 0:
                gasnum = 0
                length = 0
            else:
                length += 1
            if length == n:
                ans = i - n + 1
                break
        return ans

class Solution:
    def canCompleteCircuit(self, gas: List[int], cost: List[int]) -> int:
        # 可以按顺序绕环路行驶一周，意味着剩余油量大于消耗
        if sum(gas) < sum(cost):
            return -1

        curr_tank = 0
        start = 0
        n=len(gas)
        for i in range(n):
            curr_tank += gas[i] - cost[i]
            if curr_tank < 0:
                start = i + 1
                curr_tank = 0
        return start


#     135. 分发糖果
topic="""
n 个孩子站成一排。给你一个整数数组 ratings 表示每个孩子的评分。

你需要按照以下要求，给这些孩子分发糖果：

每个孩子至少分配到 1 个糖果。
相邻两个孩子中，评分更高的那个会获得更多的糖果。
请你给每个孩子分发糖果，计算并返回需要准备的 最少糖果数目 。

 

示例 1：

输入：ratings = [1,0,2]
输出：5
解释：你可以分别给第一个、第二个、第三个孩子分发 2、1、2 颗糖果。
示例 2：

输入：ratings = [1,2,2]
输出：4
解释：你可以分别给第一个、第二个、第三个孩子分发 1、2、1 颗糖果。
     第三个孩子只得到 1 颗糖果，这满足题面中的两个条件。
"""


class Solution:
    def candy(self, ratings: List[int]) -> int:
        # 小朋友分到的糖果是由相邻左右两个人决定的，所以就需要知道左边人对他的影响，以及右边人的影响，两个方向得到的糖果数取最大值
        # 左边小朋友分得的糖果数量，需要从左边第一个小朋友一路数过来，而右边也同理，也需要从右边一路数过来。
        # 所以我们需要两遍遍历，第一遍从左往右数，默认第一个小朋友分1个糖果，如果右边小朋友分数更高，则糖果加一，如果分数相等或低，则重新分配1个糖果
        # 第一遍遍历结束后，最右边的小朋友的糖果数是确定的，然后按照这个小朋友的糖果数从右往左遍历，对比每个小朋友的左右糖果数最大值，然后求和。
        ans = 0
        n = len(ratings)
        candy = [1] * n
        for i in range(1, n):
            if ratings[i] > ratings[i - 1]:
                candy[i] = candy[i - 1] + 1
        candy_n = candy[-1]
        for i in range(n - 2, -1, -1):
            if ratings[i] > ratings[i + 1]:
                candy[i] = max(candy[i], candy[i + 1] + 1)
            candy_n += candy[i]
        return candy_n


# 860.柠檬水找零
topic="""
在柠檬水摊上，每一杯柠檬水的售价为 5 美元。顾客排队购买你的产品，（按账单 bills 支付的顺序）一次购买一杯。

每位顾客只买一杯柠檬水，然后向你付 5 美元、10 美元或 20 美元。你必须给每个顾客正确找零，也就是说净交易是每位顾客向你支付 5 美元。

注意，一开始你手头没有任何零钱。

给你一个整数数组 bills ，其中 bills[i] 是第 i 位顾客付的账。如果你能给每位顾客正确找零，返回 true ，否则返回 false 。

 

示例 1：

输入：bills = [5,5,5,10,20]
输出：true
解释：
前 3 位顾客那里，我们按顺序收取 3 张 5 美元的钞票。
第 4 位顾客那里，我们收取一张 10 美元的钞票，并返还 5 美元。
第 5 位顾客那里，我们找还一张 10 美元的钞票和一张 5 美元的钞票。
由于所有客户都得到了正确的找零，所以我们输出 true。
示例 2：

输入：bills = [5,5,10,10,20]
输出：false
解释：
前 2 位顾客那里，我们按顺序收取 2 张 5 美元的钞票。
对于接下来的 2 位顾客，我们收取一张 10 美元的钞票，然后返还 5 美元。
对于最后一位顾客，我们无法退回 15 美元，因为我们现在只有两张 10 美元的钞票。
由于不是每位顾客都得到了正确的找零，所以答案是 false。
"""
class Solution:
    def lemonadeChange(self, bills: List[int]) -> bool:
        # 用一个字典来记录当前有的零钱的类型
        # 用一个变量来记录总钱数
        dic=dict()
        dic[5]=0
        dic[10]=0
        dic[20]=0
        count=0
        ans=True
        for p in bills:
            if p==10:
                dic[10]=dic[10]+1
                # 需要找零5元
                if dic[5]==0:
                    ans=False
                    break
                else:
                    dic[5]=dic[5]-1
            if p==20:
                dic[20]=dic[20]+1
                # 需要找零15元
                # 有10元的先找10元的
                if dic[10]==0:
                    if dic[5]<3:
                        ans=False
                        break
                    else:
                        dic[5]=dic[5]-3
                else:
                    dic[10]=dic[10]-1
                    if dic[5]==0:
                        ans=False
                        break
                    else:
                        dic[5]=dic[5]-1
            if p==5:
                dic[5]=dic[5]+1
        return ans


# 406.根据身高重建队列
topic="""
假设有打乱顺序的一群人站成一个队列，数组 people 表示队列中一些人的属性（不一定按顺序）。每个 people[i] = [hi, ki] 表示第 i 个人的身高为 hi ，前面 正好 有 ki 个身高大于或等于 hi 的人。

请你重新构造并返回输入数组 people 所表示的队列。返回的队列应该格式化为数组 queue ，其中 queue[j] = [hj, kj] 是队列中第 j 个人的属性（queue[0] 是排在队列前面的人）。

 

示例 1：

输入：people = [[7,0],[4,4],[7,1],[5,0],[6,1],[5,2]]
输出：[[5,0],[7,0],[5,2],[6,1],[4,4],[7,1]]
解释：
编号为 0 的人身高为 5 ，没有身高更高或者相同的人排在他前面。
编号为 1 的人身高为 7 ，没有身高更高或者相同的人排在他前面。
编号为 2 的人身高为 5 ，有 2 个身高更高或者相同的人排在他前面，即编号为 0 和 1 的人。
编号为 3 的人身高为 6 ，有 1 个身高更高或者相同的人排在他前面，即编号为 1 的人。
编号为 4 的人身高为 4 ，有 4 个身高更高或者相同的人排在他前面，即编号为 0、1、2、3 的人。
编号为 5 的人身高为 7 ，有 1 个身高更高或者相同的人排在他前面，即编号为 1 的人。
因此 [[5,0],[7,0],[5,2],[6,1],[4,4],[7,1]] 是重新构造后的队列。
示例 2：

输入：people = [[6,0],[5,0],[4,0],[3,2],[2,2],[1,4]]
输出：[[4,0],[5,0],[2,2],[3,2],[1,4],[6,0]]
"""













